In [1]:
!pip install mysql-connector

Requirement already satisfied: mysql-connector in c:\users\aayush\anaconda3\lib\site-packages (2.2.9)

In [3]:
import mysql.connector  		#importing database
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
  database = "class415pm"
)
db = database.cursor()

In [5]:
sql = "SELECT * FROM student"
db.execute(sql)
result =db.fetchall()
result

[(1, 'Ram', 89, 87, 85, 67, 78, 412, 88.5, 'A'),
 (2, 'Shyam', 89, 98, 98, 78, 89, 450, 85.6, 'A'),
 (3, 'Hari', 89, 98, 67, 81, 67, 412, 85.6, 'A'),
 (4, 'Sita', 78, 58, 60, 67, 78, 400, 74.0, 'B'),
 (5, 'Nabin', 89, 98, 67, 78, 89, 421, 82.5, 'A'),
 (6, 'Kasama', 89, 87, 80, 67, 78, 450, 88.5, 'A')]

In [6]:
sql = "SELECT * FROM student WHERE grade = 'A'"
db.execute(sql)
result =db.fetchall()
result

[(1, 'Ram', 89, 87, 85, 67, 78, 412, 88.5, 'A'),
 (2, 'Shyam', 89, 98, 98, 78, 89, 450, 85.6, 'A'),
 (3, 'Hari', 89, 98, 67, 81, 67, 412, 85.6, 'A'),
 (5, 'Nabin', 89, 98, 67, 78, 89, 421, 82.5, 'A'),
 (6, 'Kasama', 89, 87, 80, 67, 78, 450, 88.5, 'A')]

In [7]:
sql = '''INSERT INTO student ( name, physics, chemistry, math, english, nepali, total, per, grade) 
VALUES ('Nabina', 69, 87, 90, 91, 67, 470, 86.5, 'A')'''
db.execute(sql)
database.commit()

In [9]:
name = input("Enter name = ")
physics = int(input("Enter physics = "))
chemistry = int(input("Enter chemistry = "))
math = int(input("Enter math = "))
english = int(input("Enter english = "))
nepali = int(input("Enter nepali = "))
total = physics+chemistry+math+english+nepali
per = total/5
if per>=80:
    grade = 'A'
elif per>=60:
    grade = 'B'
elif per >= 45:
    grade = 'C'
else:
    grade = 'F'
    
sql = f'''INSERT INTO student ( name, physics, chemistry, math, english, nepali, total, per, grade) 
VALUES ('{name}', {physics}, {chemistry}, {math}, {english}, {nepali}, {total}, {per}, '{grade}')'''
db.execute(sql)
database.commit()

Enter name = Bikash
Enter physics = 89
Enter chemistry = 78
Enter math = 78
Enter english = 87
Enter nepali = 56

In [10]:
sql = f'''UPDATE student SET name = 'Bikash' WHERE sn = 12'''
db.execute(sql)
database.commit()

In [ ]:
name = input("Enter name = ")
sn = int(input("Enter sn = "))
sql = f'''UPDATE student SET name = '{name }' WHERE sn = {sn}'''
db.execute(sql)
database.commit()